{
    "General": [
        "Tell Me About Yourself",
        "Why do you want to work for X company?",
        "Why do you want to leave your current/last company?",
        "What are you looking for in your next role?",
        "Tell me about a time when you had a conflict with a co-worker.",
        "Tell me about a time in which you had a conflict and needed to influence somebody else.",
        "What project are you currently working on?",
        "What is the most challenging aspect of your current project?",
        "What was the most difficult bug that you fixed in the past 6 months?",
        "How do you tackle challenges? Name a difficult challenge you faced while working on a project, how you overcame it, and what you learned.",
        "What are you excited about?",
        "What frustrates you?",
        "Imagine it is your first day here at the company. What do you want to work on? What features would you improve on?",
        "What are the most interesting projects you have worked on and how might they be relevant to this company's environment?",
        "Tell me about a time you had a disagreement with your manager.",
        "Talk about a project you are most passionate about, or one where you did your best work.",
        "What does your best day of work look like?",
        "What is something that you had to push for in your previous projects?",
        "What is the most constructive feedback you have received in your career?",
        "What is something you had to persevere at for multiple months?",
        "Tell me about a time you met a tight deadline.",
        "If this were your first annual review with our company, what would I be telling you right now?",
        "Time management has become a necessary factor in productivity. Give an example of a time-management skill you've learned and applied at work.",
        "Tell me about a problem you've had getting along with a work associate.",
        "What aspects of your work are most often criticized?",
        "How have you handled criticism of your work?",
        "What strengths do you think are most important for your job position?",
        "What words would your colleagues use to describe you?",
        "What would you hope to achieve in the first six months after being hired?"
    ],
    "Product Management": [
        "Tell me about yourself.",
        "Tell me about the most boring job you have ever had.",
        "What changes would you make if you came on board?",
        "What would you say to your boss if he is crazy about an idea, but you think it stinks?",
        "Assuming that you are selected, what will be your strategy for next 60 days?",
        "why are not you earning more money at this stage of your career?",
        "Why should we hire you?",
        "Looking back, what would you do differently in your life?",
        "What are your weaknesses?",
        "Tell me something about our company.",
        "Why should I hire you from the outside when I could promote someone from within?",
        "What is the difference between confidence and over-confidence?",
        "Tell me honestly about the strong points and weak points of your boss (company, management team, etc.)",
        "Why are you leaving your job?",
        "How do you like LinkedIn's endorse feature?",
        "What would you do the next 2 years if you were CEO of the company?",
        "What's your approach to hiring?",
        "How could you have improved your career progress?",
        "Describe your ideal company, location and job.",
        "Is consensus always a good thing?",
        "Who has the ultimate accountability for shipping a product?",
        "What are your strengths?",
        "Would you lie for the company?",
        "On a scale of one to ten, rate me as an interviewer.",
        "Who has inspired you in your life and why?",
        "How do you feel about reporting to a younger person?",
        "If you won $10 million lottery, would you still work?",
        "What makes you angry?",
        "Which do you like first, the good news or the bad news?",
        "What are your goals?",
        "What kinds of people do you like to work with?",
        "Aren't you overqualified for this position?",
        "How long would you expect to work for us if hired?",
        "What was the toughest decision you ever had to make?",
        "What motivates you to do good job?",
        "Could you have done better in your last job?",
        "How much salary do you expect?",
        "Can you work under pressure?",
        "Give me an example of your creativity.",
        "What are your career options right now?",
        "Where do you see yourself in five years?",
        "Do you manage people from different functions differently? If so, how?",
        "What have you learned about saying no?",
        "How do you get a team to commit to a schedule?",
        "How do you prioritize a list of product features?",
        "What do you like to do in your spare time?",
        "What's the difference between management and leadership?",
        "How has your tolerance for mistakes changed over the years?",
        "Have you considered starting your own business?",
        "Select a product you use everyday and discuss its weaknesses.",
        "What would somebody do to lose your confidence?",
        "Why do you want to work here?",
        "What types of people have you found it difficult to work with?",
        "How do you feel about working nights and weekends?",
        "How do you define success and how do you measure up to your own definition?",
        "What is the difference between hard work and smart work?"
    ],
    "Amazon Leadership Principles": [
        "Tell me about a time you knew you couldn’t do everything the client wanted. How did you prioritize, and what was the outcome?",
        "Give me an example of a time things went very poorly in a customer interaction or when delivering a service or product. How did you try to make things right?",
        "In your experience, what makes some customers especially difficult to manage while others are easier?",
        "Tell me about a time you chose to apologize for doing something wrong, even though you weren’t 100% sure it was your fault.",
        "Have you ever obsessed over giving high quality service to a customer?",
        "Tell me about a time when you had to make a difficult short term decision to make long term gains.",
        "Tell me about a time when you took on a task that went beyond your normal responsibilities.",
        "Tell me about a time when you took it upon yourself to work on a challenging initiative.",
        "Tell me about a time when you failed to simplify a process and what you would have done differently.",
        "Tell me about a time when you innovated on something and it went wrong.",
        "Tell me about a time when you changed a process at work through either an innovative new way or simplification.",
        "Have you ever invented a service, product, or process that could truly be described as unique?",
        "Given me an example of a time that you were faced with a complex problem, but the solution you designed could be described as simple.",
        "Who was your most difficult customer?",
        "Tell me about a time when you had to leave a task unfinished.",
        "Tell me about a time when you innovated on something and it went wrong.",
        "Tell me about a time when you had to work with incomplete data or information.",
        "Tell me about the most important lesson you learned in the past year.",
        "Tell me about a time when you made a wrong hire. When did you figure it out and what did you do?",
        "Tell me about a time when you raised the bar.",
        "Tell me about a time when you went way beyond the scope of the project and delivered.",
        "Tell me about a time when you took a calculated risk.",
        "Tell me about a time you had to rely on yourself to finish a task.",
        "What do you do to gain the trust of your teammates?",
        "Tell me about a time you utilized in depth data to come across a solution.",
        "Tell me about an unpopular decision of yours.",
        "Give me an example of a time when you were 75% of the way through a project, and you had to pivot strategy–how were you able to make that into a success story?",
        "Tell the story of the last time you had to apologize to someone.",
        "Tell me about a time when you had to work on a project with unclear responsibilities.",
        "Tell me about a time when you gave a simple solution to a complex problem.",
        "Tell me about a time when you had to use your judgment to solve a problem.",
        "Tell me about a time when you influenced a change by only asking questions.",
        "What qualities do you look for most when hiring others?",
        "Tell me about a time when you couldn’t meet your own expectations on a project.",
        "Tell me about your proudest professional achievement.",
        "Tell me about a time you needed to get information from someone who wasn’t very responsive. What did you do?",
        "Tell me about a time when you had to work with limited time or resources.",
        "Tell me about a time when you had to tell someone a harsh truth.",
        "Tell me about the most complex problem you’ve ever worked on.",
        "Tell me about a time when you had to step up and disagree with a team member’s approach.",
        "What is the most difficult situation you have ever faced in your life? How did you handle it?",
        "Give me an example of a time when you did not meet a client’s expectation. What happened, and how did you attempt to rectify the situation?",
        "Tell me about a time when you had to make a difficult short term decision to make long term gains.",
        "Tell me about a time when you failed to simplify a process and what you would have done differently.",
        "Tell me about a time when you were wrong.",
        "Tell me about a time when you solved a problem through just superior knowledge or observation.",
        "Tell me about a time when you mentored someone.",
        "Tell me about a time when a team member didn’t meet your expectations on a project.",
        "Tell me about a time when you were disappointed because you didn’t think big enough.",
        "Describe a time when you saw some problem and took the initiative to correct it rather than waiting for someone else to do it.",
        "Tell me about a time where you turned down more resources to complete an assignment.",
        "What would you do if you found out that your closest friend at work was stealing?",
        "Tell me about something that you learnt recently in your role.",
        "Tell me about a time when you did not accept the status quo.",
        "Tell me about a time when everyone else on your team gave up on something but you pushed the team towards delivering a result.",
        "Can you tell me about a time you obsessed over giving very high quality service to a customer?",
        "Tell me about a time when you took on a task that went beyond your normal responsibilities.",
        "Tell me about a time when you changed a process at work through either an innovative new way or simplification.",
        "Tell me about a time when you had your beliefs challenged and how you responded.",
        "Tell me about a time when your curiosity helped you make a smarter decision.",
        "Who is the most important person in your life and why?",
        "Tell me about a time when you were dissatisfied with the quality of something at work and went out of your way to improve it.",
        "Tell me about a time when you had to make a bold and difficult decision."
    ]
}